def solution(board):
    """
    
    1. 문제 이해
        1로 이루어진 가장 큰 정사각형을 찾아 넓이를 return 하는 문제.
        입력: [[0,1,1,1],[1,1,1,1],[1,1,1,1],[0,0,1,0]]	
        출력해야 하는 것  :  9 (가장 큰 정사각형의 넓이 = 정사각형 한 변**2)
        제약 조건 : 격자 크기 = 10^3 * 10^3 -> O(n) or O(nlogn)으로 해결 필요
        
    2. 접근 방식
        2-1. 직관
            현재 위치에서 오른쪽이랑 밑만 탐색(BFS)해서 같은 집단을 찾고, 거기서 width , height 검사.
            
        2-2 직관 실패.
            오른쪽이랑 밑만 탐색하는 방식은 정사각형을 전혀 판별할 수 없다.
            딱 정사각형만 판별하는 법. -> DP배열을 이용.
        2-3. DP인 이유
            이중 반복문을 사용해 (0,0) 부터 (n-1, m-1)까지 이전의 계산 값을 이용해 누적해가는 구조
            -> 최적 부분 구조 -> DP 
            상향식 DP -> DP 테이블 이용
            
            2-3.1) 문제의 출력에서 찾을 수 있는 DP의 힌트 : 
            
            
    3. 코드 설계
        1. 이중 반복문으로 board == 1일 때, (row+1, col) , (row, col+1) 두 방향 BFS탐색
        
    꼭 필요한 것 : 누적되는 구조가 아니라면 DP를 사용하는게 아니다!
        탐색이라면 DFS, BFS도 고려 대상에 있다.
        하나를 깊게 판다 -> DFS
        일반 가중치 1의 격자 탐색 -> BFS가 재귀문제도 없고 가지치기가 없어 구현도 편리함.
        
    누적되는 최적 부분구조에서만 DP를 사용한다.
    
    """
    
    answer = 0
    
    n = len(board)
    m = len(board[0])
    
    dp = [[0]*(m+1) for _ in range(n+1)]
    
    #맨 마지막 행, 열이 dp수행이 안되는 문제
    for i in range(n):
        for j in range(m):
            if board[i][j] == 1:
                dp[i+1][j+1] = min(dp[i+1][j] , dp[i][j+1], dp[i][j]) + 1
    
   # print(dp)
    for i in range(1, n+1):
        for j in range(1, m+1):
            answer = max(answer, dp[i][j]) 
                
    return answer**2